wed1_summary.org
:PROPERTIES:
:ID:       0c73b466-3abb-4c76-b458-e693a8856453
:ROAM_ALIASES: wed1
:END:
#+title: Web Engineering + Design 1
#+SETUPFILE: ~/roam/ost_exam_summary_setup.conf

\begin{multicols}{4}
* Begriffe
HTML (Hyper Text Markup Language) ist für die Semantic zuständing. CSS für das styling der Elemente und JS für das interaktive Verhalten der Website.

*Web-Seite* ist ein einzelnes HTML-Dokument, eine *Web-Site* mehrer verlinkte Web-Seiten unter der selben Domain.

* HTML - Basics
Parsing: Load HTML -> Parse HTML -> Generate DOM -> Display
Encoding muss angegeben werden (=<meta charset ="UTF-8>=. *Void-Elemente* haben kein Content und kein End-Tag. Ein End-Slash ist erlaubt (=<tag attribute ="value"/h>=

Im head-Element stehen Meta-Informatinen zur Website (charset, Language, Title, ...).

** Content Model
Nicht alle Tags können beliebig in einander verschachtelt werden. Bei jedem Tag sind folgende Eigenschaften angegeben: *Permitted Content*, *Tag omission*, *Permitted parents*, *Permitted ARIA roles* und *DOM interface*.

*Tag-Omission* gibt an, ob ein Tag (Start / End) vorhanden sein muss, weggelassen werden kann, oder nicht vorhanden sein darf (Void-Elemente). Es sollte dennoch alle erlaubten Start- und End-Tags gesetzt werden.

** Section
body, article, aside, nav und section können einen header, footer, h1 besitzten. Bei neuen Sections ist zwar ein neues h1 erlaubt, gilt aber nicht als best-practice (Screenreaders)

** Semantic
Tags für die Semantic korrekt einsetzten
- main
- header
- footer
- nav
- figure
- figcaption
- article
- section
- aside
- details

* JavaScript (JS)
Offizieller Name *ECMAScript*. JS ist *dynamisch*,  *dynamisch typisiert*, *funktional*, *objekt-orientiert*. Häufig wird keine Exception geworfen und ist meistens interpretiert. 

Typen in JS:
- *Primitive Type*:
- string, number, boolean, null, undefined, symbol (ECMAScript 6)
- compared by value
- immer immutable

- *Objekte*:
- Plain Objects, Arrays, Regular Expresions, Functions
- compared by reference
- mutable by default


*Achtung*: =typeof(null)= gibt ='object'= zurück

** Falsy / Truthy
Als =false=-Werte werden folgende Werte interpretiert:
- false,
- 0
- "" (empty string)
- null
- undefined
- NaN

Der Rest wird als =true=  interpretiert.

** Number
Alle Zahlen sind =float=. Wenn möglich werden =float= als =integers= abgebildet. =NaN= (Not a Number)ist ein Error-Wert vom Typ =number=. Vergleich zwischen zwei =NaNs= ergibt immer =false=. Zur Überprüfung muss =isNaN()= verwendet werden. =Infinity= kann auch positiv und negativ sein. Jeder Wert kann in eine Zahl verwandelt werden, ausser =symbol=.
#+begin_src js
+(true) == 1
Number(true) == 1
isNaN(Number('abc')) == true
#+end_src

Die Funktionen =parseInt()= und =parseFloat= parsen bis zum ersten Fehler.


** String
Single und Double Quotes sind möglich. Seit ECMAScript 6 gibt es auch *Template Literals* / *Template Strings*. Ermöglicht Strings mit Plateholder. Werden durch Backticks (`) eingeleitet. Innerhalb von =${...}= wird JS ausgeführt.

** Operatoren
Es gilt *Punkt vor Strich* und es wird von links nach rechts aufgelöst. *Achtung*: =String + Value = String= und =Value + String = String=.
Mit dem ==== muss aufgepasst werden, da automatische Typumwandlungen statt finden. Um die Typumwandlung zu vermeiden sollte ===== verwendet werden.

** null != undefined
*undefined*: Variable ist nicht definiert oder wurde nicht initialisiert. *null* wird verwendet, wenn ein Objekt erwartet wird. Funktionen die undefined zurückgeben haben keinen Rückgabewert, Funktionen die null zurückgeben haben einen Rückgabe werde, aber nicht in diesem Fall. *Achtung:* =null == undefined= ergibt =true=.

** array
Zwei for-each-Loops für Arrays: *For-In* iteriert über die Propery Name und *For-Of*über die Werte:
#+begin_src js
for (const x in arr) {
    console.log('for in', x + ':' + arr[x]);
}

for (const x of arr) {
    console.log('for of', x);
}
#+end_src
Unterstützt ganzzahlige Nummern als Indexe, andere werden in String umgewandelt (verhält sich wie ein Objekt). Die Funktion =length= des Arrays beachtet aber nur die echten Array Einträgen. *Wichtig*: Arrays wie Arrays verwenden.

** Object
Object ist eine Sammlung von Properties. Properties und Methoden können hinzugefügt und verändert werden. Auch von Standard-Objekten, sollte aber nicht gemacht werden. Jedes Objekt ist eine HashTable (ausgenommen null, undefined). Es kann mittels =obj[PropertyName]= auf die Properties zugegriffen werden. Alle Index werden in String umgewandelt.

** Functions
Bei Funktionen können mehr oder weniger als geforderte Anzahl Parameter übergeben. Funktionen besitzen auch Properties. =name= der Funktion, =length= die Anzahl Parameter. Es können aber weiter Eigenschaften hinzugefügt werden. Funktionen können Funktionen zurückgeben. Alle Parameter werden in =arguments= abgelegt, sollte in Array umgewandelt werden (=Array.from(arguments);=). Mit =...name= kann der letzte Parameter der Funktion mit allen restlichen Werten gefüllt werden als (Array).
JS kennt kein *Function Overloading*, die letzte Funktion mit selben Name überschreibt die Vorherigen. Interne Weiche oder default-Werte.

*Arrow Funktionen* werden oft auch Lambda genannt. Sinnvoll für kleine Funktionen z.B. als Filter Parameter:
#+begin_src js
[1, 2, 3].map(x => x*x)
#+end_src
Bei Arrow-Funktionen ist der Context immer auf das selbe Objekt gebunden.

** Scope
Geltungsbereich, wo etwas gültig oder verfügbar ist. Globale variabel können im Browser über =window.myGlobalVariable= bzw. in Node über =global.myGlobalVariable= zugegriffen werden. Globale Variablen vermeiden, aufgrund von *Global Namespace Pollution* (zu viele Variablen / Funktionen => überschreiben sich gegenseitig). Lösung sind [[*Module][Module]]. Script-Tags erzeugen kann neuen Scope.

** Context
=this= ist der aktuelle Context. Je nach Aufrufart wird ein anders Objekt referenziert. Bei =object.foo()= wird =object= referenziert. Bei /unbound/ Funktionen zeigt =this= auf das globale Objekt. Mittels =apply()= oder =call()= kann der Context gesetzt werden. Die vorherigen Regel werden ignoriert. Z.B. =foo.call({ counter: 123});=

** Strict Mode
Mittels *use strict* werden folgenden 
- Eliminiert /fails slently/
- Probleme welche es dem Compiler verermöglicht den Code zu optimieren
- Security wird leicht verbessert

Strict Mode kann nicht mehr entfernt werden, wenn mal aktiviert, muss pro File aktiviert werden und Strict Mode JS sollte nicht mit Non Strict Mode JS zu einem JS file vereint werden. Sollte nach Möglichkeit immer genutzt werden.

