WED1/wed1_summary.tex
% Created 2021-08-26 Thu 10:59
% Intended LaTeX compiler: pdflatex
\documentclass[11pt,twoside,landscape]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[top=2cm,bottom=2cm,right=2cm,left=2cm,landscape]{geometry}
\usepackage{multicol}
\usepackage{enumitem}
\setlist{noitemsep}
\setlength{\parindent}{0pt}
\setlength{\columnseprule}{0.2pt}
\setcounter{secnumdepth}{0}
\author{Olivier Lischer}
\date{\today}
\title{Web Engineering + Design 1}
\hypersetup{
 pdfauthor={Olivier Lischer},
 pdftitle={Web Engineering + Design 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{multicols}{4}
\section*{Begriffe}
\label{sec:org9824f5c}
HTML (Hyper Text Markup Language) ist für die Semantic zuständing. CSS für das styling der Elemente und JS für das interaktive Verhalten der Website.

\textbf{Web-Seite} ist ein einzelnes HTML-Dokument, eine \textbf{Web-Site} mehrer verlinkte Web-Seiten unter der selben Domain.

\section*{HTML - Basics}
\label{sec:orgb4bcfee}
Parsing: Load HTML -> Parse HTML -> Generate DOM -> Display
Encoding muss angegeben werden (\texttt{<meta charset ="UTF-8>}. \textbf{Void-Elemente} haben kein Content und kein End-Tag. Ein End-Slash ist erlaubt (\texttt{<tag attribute ="value"/h>}

Im head-Element stehen Meta-Informatinen zur Website (charset, Language, Title, \ldots{}).

\subsection*{Content Model}
\label{sec:org73b6e07}
Nicht alle Tags können beliebig in einander verschachtelt werden. Bei jedem Tag sind folgende Eigenschaften angegeben: \textbf{Permitted Content}, \textbf{Tag omission}, \textbf{Permitted parents}, \textbf{Permitted ARIA roles} und \textbf{DOM interface}.

\textbf{Tag-Omission} gibt an, ob ein Tag (Start / End) vorhanden sein muss, weggelassen werden kann, oder nicht vorhanden sein darf (Void-Elemente). Es sollte dennoch alle erlaubten Start- und End-Tags gesetzt werden.

\subsection*{Section}
\label{sec:orgb482018}
body, article, aside, nav und section können einen header, footer, h1 besitzten. Bei neuen Sections ist zwar ein neues h1 erlaubt, gilt aber nicht als best-practice (Screenreaders)

\subsection*{Semantic}
\label{sec:org6cedca4}
Tags für die Semantic korrekt einsetzten
\begin{itemize}
\item main
\item header
\item footer
\item nav
\item figure
\item figcaption
\item article
\item section
\item aside
\item details
\end{itemize}

\section*{JavaScript (JS)}
\label{sec:org7a1f731}
Offizieller Name \textbf{ECMAScript}. JS ist \textbf{dynamisch},  \textbf{dynamisch typisiert}, \textbf{funktional}, \textbf{objekt-orientiert}. Häufig wird keine Exception geworfen und ist meistens interpretiert. 

Typen in JS:
\begin{itemize}
\item \textbf{Primitive Type}:
\item string, number, boolean, null, undefined, symbol (ECMAScript 6)
\item compared by value
\item immer immutable

\item \textbf{Objekte}:
\item Plain Objects, Arrays, Regular Expresions, Functions
\item compared by reference
\item mutable by default
\end{itemize}


\textbf{Achtung}: \texttt{typeof(null)} gibt \texttt{'object'} zurück

\subsection*{Falsy / Truthy}
\label{sec:org3935f94}
Als \texttt{false}-Werte werden folgende Werte interpretiert:
\begin{itemize}
\item false,
\item 0
\item "" (empty string)
\item null
\item undefined
\item NaN
\end{itemize}

Der Rest wird als \texttt{true}  interpretiert.

\subsection*{Number}
\label{sec:org486a7af}
Alle Zahlen sind \texttt{float}. Wenn möglich werden \texttt{float} als \texttt{integers} abgebildet. \texttt{NaN} (Not a Number)ist ein Error-Wert vom Typ \texttt{number}. Vergleich zwischen zwei \texttt{NaNs} ergibt immer \texttt{false}. Zur Überprüfung muss \texttt{isNaN()} verwendet werden. \texttt{Infinity} kann auch positiv und negativ sein. Jeder Wert kann in eine Zahl verwandelt werden, ausser \texttt{symbol}.
\begin{verbatim}
+(true) == 1
Number(true) == 1
isNaN(Number('abc')) == true
\end{verbatim}

Die Funktionen \texttt{parseInt()} und \texttt{parseFloat} parsen bis zum ersten Fehler.


\subsection*{String}
\label{sec:org27c7926}
Single und Double Quotes sind möglich. Seit ECMAScript 6 gibt es auch \textbf{Template Literals} / \textbf{Template Strings}. Ermöglicht Strings mit Plateholder. Werden durch Backticks (`) eingeleitet. Innerhalb von \texttt{\$\{...\}} wird JS ausgeführt.

\subsection*{Operatoren}
\label{sec:orgbeddc6c}
Es gilt \textbf{Punkt vor Strich} und es wird von links nach rechts aufgelöst. \textbf{Achtung}: \texttt{String + Value = String} und \texttt{Value + String = String}.
Mit dem \texttt{==} muss aufgepasst werden, da automatische Typumwandlungen statt finden. Um die Typumwandlung zu vermeiden sollte \texttt{===} verwendet werden.

\subsection*{null != undefined}
\label{sec:org1d65242}
\textbf{undefined}: Variable ist nicht definiert oder wurde nicht initialisiert. \textbf{null} wird verwendet, wenn ein Objekt erwartet wird. Funktionen die undefined zurückgeben haben keinen Rückgabewert, Funktionen die null zurückgeben haben einen Rückgabe werde, aber nicht in diesem Fall. \textbf{Achtung:} \texttt{null =} undefined= ergibt \texttt{true}.

\subsection*{array}
\label{sec:org084a144}
Zwei for-each-Loops für Arrays: \textbf{For-In} iteriert über die Propery Name und *For-Of*über die Werte:
\begin{verbatim}
for (const x in arr) {
    console.log('for in', x + ':' + arr[x]);
}

for (const x of arr) {
    console.log('for of', x);
}
\end{verbatim}
Unterstützt ganzzahlige Nummern als Indexe, andere werden in String umgewandelt (verhält sich wie ein Objekt). Die Funktion \texttt{length} des Arrays beachtet aber nur die echten Array Einträgen. \textbf{Wichtig}: Arrays wie Arrays verwenden.

\subsection*{Object}
\label{sec:orgfeb8180}
Object ist eine Sammlung von Properties. Properties und Methoden können hinzugefügt und verändert werden. Auch von Standard-Objekten, sollte aber nicht gemacht werden. Jedes Objekt ist eine HashTable (ausgenommen null, undefined). Es kann mittels \texttt{obj[PropertyName]} auf die Properties zugegriffen werden. Alle Index werden in String umgewandelt.

\subsection*{Functions}
\label{sec:orgbafc31d}
Bei Funktionen können mehr oder weniger als geforderte Anzahl Parameter übergeben. Funktionen besitzen auch Properties. \texttt{name} der Funktion, \texttt{length} die Anzahl Parameter. Es können aber weiter Eigenschaften hinzugefügt werden. Funktionen können Funktionen zurückgeben. Alle Parameter werden in \texttt{arguments} abgelegt, sollte in Array umgewandelt werden (\texttt{Array.from(arguments);}). Mit \texttt{...name} kann der letzte Parameter der Funktion mit allen restlichen Werten gefüllt werden als (Array).
JS kennt kein \textbf{Function Overloading}, die letzte Funktion mit selben Name überschreibt die Vorherigen. Interne Weiche oder default-Werte.

\textbf{Arrow Funktionen} werden oft auch Lambda genannt. Sinnvoll für kleine Funktionen z.B. als Filter Parameter:
\begin{verbatim}
[1, 2, 3].map(x => x*x)
\end{verbatim}
Bei Arrow-Funktionen ist der Context immer auf das selbe Objekt gebunden.

\subsection*{Scope}
\label{sec:org7b4bbd2}
Geltungsbereich, wo etwas gültig oder verfügbar ist. Globale variabel können im Browser über \texttt{window.myGlobalVariable} bzw. in Node über \texttt{global.myGlobalVariable} zugegriffen werden. Globale Variablen vermeiden, aufgrund von \textbf{Global Namespace Pollution} (zu viele Variablen / Funktionen => überschreiben sich gegenseitig). Lösung sind \hyperref[sec:orge2cc30a]{Module}. Script-Tags erzeugen kann neuen Scope.

\subsection*{Context}
\label{sec:org8b4c0b6}
\texttt{this} ist der aktuelle Context. Je nach Aufrufart wird ein anders Objekt referenziert. Bei \texttt{object.foo()} wird \texttt{object} referenziert. Bei \emph{unbound} Funktionen zeigt \texttt{this} auf das globale Objekt. Mittels \texttt{apply()} oder \texttt{call()} kann der Context gesetzt werden. Die vorherigen Regel werden ignoriert. Z.B. \texttt{foo.call(\{ counter: 123\});}

\subsection*{Strict Mode}
\label{sec:org456f52a}
Mittels \textbf{use strict} werden folgenden 
\begin{itemize}
\item Eliminiert \emph{fails slently}
\item Probleme welche es dem Compiler verermöglicht den Code zu optimieren
\item Security wird leicht verbessert
\end{itemize}

Strict Mode kann nicht mehr entfernt werden, wenn mal aktiviert, muss pro File aktiviert werden und Strict Mode JS sollte nicht mit Non Strict Mode JS zu einem JS file vereint werden. Sollte nach Möglichkeit immer genutzt werden.
