wed1_summary.org
** Klassen
Ähnlich wie in Java. Private wird mit dem Prefix =#= ermöglicht. Es gibt getter und setter (=get time() {...} / set time(){...}=. JS unterstützt Vererbung (=class AlarmClock extends Clock {...}=). Mittels =instanceof= kann überprüft werden ob ein Objekt eine Instanz einer Klasse ist. Mittels =super= kann auf den Parent zugegriffen werden.

Es gibt auch *Prototype* - *kein Prüfungsstoff*

** Module
Script-Tags erzeugen kein neuen Scope, Reihenfolge wie die Files eingebunden werden ist relevant. Um die Probleme zu umgehen können EcmaScript Module (ESM) eingesetzt werden. Werden im HTML wie folgt eingebunden:
#+begin_src js
<script src="main.js" defer type="module"></script>
#+end_src
Mit =import ... from '...'= werden Funktionalität aus einem Modul importiert. Mittels =export= wird Funktionalität exportiert. Es gibt beim Import Named (=bar as b=) und Default. Sind immer im /strict mode/

** Shim / Polyfill
*A polyfill is a shim for a browser API*. Implementieren API's die noch nicht zur Verfügung stehen, fix JS Bugs in alten Browser, können entfernt werden, wenn nicht mehr notwendig.

** Symbol
A symbol is a unique and immutable data type and may be used as an identifier for object properteis

* CSS
** Selektor
- =#= ID
- =.= class
- Typen (tags)
- =*= Universal
- =tag[attribute]=
- =a::before= Pseudo-Element
- =a:hover= = Pseudo-Element
- =article.recent= Compound
- =.recent h1= decendant
- =>= child
- =+= next sibling
- =~= subsequent siblings


** Attribut Selektoren
Mit dem Attribut-Selektor kann man vergleiche Anstellen:
- =[a=v]=: ist gleich v
- =[a~=v]=: enthält v
- =[a|=v]=: beginnt mit v-
- =[a^=v]=: beginnt mit v
- =[a$=v]=: endet mit v
- =[a*=v]=: v ist mindestens einmal enthalten


** Pseudoelement
Pseudoelemente erlauben es, bestimmte Teile eines Elements zu formatieren.
- =::first-line=
- =::first-letter=
- =::before= (erstellt neues Element)
- =::after= (erstellt neues Element)
- =::selection=


** Pseudoklassen
Pseudklassen werden verwendet, um auf Basis von verschiedenen Zuständen oder Eigenschaften Elemente zu selektieren.
- dynamische Klassen: =:hover=, =:focus=, =:visited=, ...
- strukturelle Klassen: =:root=, =:first-child=, =:nth-child()=, =:empty=, ...
- andere: =:lang()=, =:not()=, ...


Bei den Pseudoklassen die mit =nth-= beginnen, starte der Index bei 1. Die Pseudoklasse =:not= darf keine Pseudoelemente und keine weiteres =:not= enthalten.


** Kombinatoren
- =e > s=: Kindselektor
- =e s=: Nachfarenselektor
- =e + s=: Angrenzende Geschwister (Nachbar)
- =e ~ s=: Allgemeine Geschwister


** Spezifität
Mit CSS können verschiedene gegensätzliche Anweisungen verwendet werden. Hier entscheidet die Spezifizität. Quellen nach Priorität:
1. Browser (mit Default Werten)
2. Benutzer (Vom Nutzer des Browser)
3. Autor (Stylesheets, welche mit der Webseite mitgeliefert werden.


Um die Spezifität wird aus dem gesamten Selektor berechnet:
1. Drei Zähler (A, B, C) mit Startwert 0
2. A++ für jeden Selektor von IDs (#...)
3. B++ für jeden Selektor von Klassen (. ...), sowie Pseudoklassen (: ...) und Attributen ([...])
4. C++ für jeden Selektor von Element-Typen sowie Pseudoelementen (:: ...)
5. Spzifität = $A \cdot 100 + B \cdot 10 + C$

Der Universalselektor =*= wird ignoriert.

Das Keyword =!important= kann ein Style als wichtig markieren. Sollte nie verwendet werden, wenn das CSS unter eigener Kontrolle ist.
* DOM
*Document Object Model (DOM)* repräsentiert HTML-Dokument als Busstruktur. Attribute Nodes sind zugreifbar mit =elementNode.getAttributeNode()= gelten aber nicht als Teil des DOM Trees.

** DOM suchen
- =document.getElementById()=
- =document.getElemtsByName()=
- =<searchRoot>.getElementsByClassName()=
- =<searchRoot>.getElementsByTagName()=
- =<searchRoot>.querySelector()=
- =<searchRoot>.querySelectorAll()=
- =<searchRoot>.closets()=
- =<searchRoot>.matches()=

die =getElementsBy...= Funktionen geben eine =HTMLCollection= zurück (kein Array). Beim Anpassen des DOMs wird die Collection angepasst (Live-Queries, gefährlich). Es sollte daher die modernen Such-Funktionen verwendet werden. Diese erzeugen keine Live-Queries. Auch die neuen Funktionen geben *kein* Array zurück (umwandlung mittels =Array.from()= oder =[...nodeList]=)

** DOM Navigation
Node Interface hat Methoden zur Navigation in DOM (read-only!):
- =<node>.parentElement=
- =<node>.childNodes= (auch Text-Nods, Kommentare)
- =<node>.children= (nur HTMLElemente)
- =<node>.firstChild= (auch text-Nodes, Kommentare)
- =<node>.firstElementChild= (HTMLElemente)
- =<node>.nextSibling= (auch Text, Kommentare)
- =<node>.nextElementSibling= (Element)

** DOM Manipulation
Neues Element erstellen:
- =document.createElement()=
- =document.createTextNode()=
- =document.createDocumentFragment=

Empfohlen über =container.insertAdjacentHTML()=. Um CSS-Classen zu manipulieren sollten =<element>.classList= genutzt werden und nicht mehr =className=. Die Property Style sollte nicht genutzt werden. Besser ist das setzten einer CSS-Klasse.

Bezüglich Performance sollte *nicht* innerHTML in einer Schleife verwendet werden (Einmalig OK).

** Attribute
- =setAttribute()=
- =removeAttribute()=

Wenn boolesche Attribute im HTML gesetzt werden sind sie true (auch =checked ="false"= ist true). Wenn das Attribute nicht vorhanden ist, ist es false.

** DOM Events
Um Events auf einem Element zu registrieren geht man wie folgt vor:
#+begin_src js
const element = document.querySelector('#myID');
element.addEventListner('click', () => alert('1'));
#+end_src 
Möglich auch über =element.on...= oder im HTML inline. Mittels =addEventListener= sind mehrere Registrierungen möglich. Die =on...= Variante überschreibt die vorherige Zuweisung. Die Inline-Version ist geeignet für Prototypen / Prüfung / Generierten Code).

Eine Event durchläuft 3. Phasen: 
1. *Capture-Phase*: vom Root zum Leaf (jedes Element kann reagieren)
2. *Target-Phase*: Event wird auf dem /Ziel/ ausgelöst
3. *Bubble Phase*: Das Event durchläuft den DOM von Leaf zum Root (nicht jedes Event)

Bei den meisten Events werden Zusatzinformationen mit gegeben. Diese werden der Event-Callback-Funktion als Parmeter mitgegeben. Das Event-Object hat folgende wichtigen Properties / Methoden: 
- =target=: Element auf dem der Event ausgelöst wurde (z.B: l
- =preventDefault()=: verhindert Default-Aktionen.
- =currentTarget= 
- =stopPropagation()=: Ermöglicht das deaktivieren von /Bubbling/ und /Capturing/

