WED1/wed1_summary.tex

\subsection*{Klassen}
\label{sec:org4d85918}
Ähnlich wie in Java. Private wird mit dem Prefix \texttt{\#} ermöglicht. Es gibt getter und setter (\texttt{get time() \{...\} / set time()\{...\}}. JS unterstützt Vererbung (\texttt{class AlarmClock extends Clock \{...\}}). Mittels \texttt{instanceof} kann überprüft werden ob ein Objekt eine Instanz einer Klasse ist. Mittels \texttt{super} kann auf den Parent zugegriffen werden.

Es gibt auch \textbf{Prototype} - \textbf{kein Prüfungsstoff}

\subsection*{Module}
\label{sec:orge2cc30a}
Script-Tags erzeugen kein neuen Scope, Reihenfolge wie die Files eingebunden werden ist relevant. Um die Probleme zu umgehen können EcmaScript Module (ESM) eingesetzt werden. Werden im HTML wie folgt eingebunden:
\begin{verbatim}
<script src="main.js" defer type="module"></script>
\end{verbatim}
Mit \texttt{import ... from '...'} werden Funktionalität aus einem Modul importiert. Mittels \texttt{export} wird Funktionalität exportiert. Es gibt beim Import Named (\texttt{bar as b}) und Default. Sind immer im \emph{strict mode}

\subsection*{Shim / Polyfill}
\label{sec:org0702180}
\textbf{A polyfill is a shim for a browser API}. Implementieren API's die noch nicht zur Verfügung stehen, fix JS Bugs in alten Browser, können entfernt werden, wenn nicht mehr notwendig.

\subsection*{Symbol}
\label{sec:org1e14fd1}
A symbol is a unique and immutable data type and may be used as an identifier for object properteis

\section*{CSS}
\label{sec:org146f093}
\subsection*{Selektor}
\label{sec:org67392bd}
\begin{itemize}
\item \texttt{\#} ID
\item \texttt{.} class
\item Typen (tags)
\item \texttt{*} Universal
\item \texttt{tag[attribute]}
\item \texttt{a::before} Pseudo-Element
\item \texttt{a:hover} = Pseudo-Element
\item \texttt{article.recent} Compound
\item \texttt{.recent h1} decendant
\item \texttt{>} child
\item \texttt{+} next sibling
\item \texttt{\textasciitilde{}} subsequent siblings
\end{itemize}


\subsection*{Attribut Selektoren}
\label{sec:org732c309}
Mit dem Attribut-Selektor kann man vergleiche Anstellen:
\begin{itemize}
\item \texttt{[a=v]}: ist gleich v
\item \texttt{[a\textasciitilde{}=v]}: enthält v
\item \texttt{[a|=v]}: beginnt mit v-
\item \texttt{[a\textasciicircum{}=v]}: beginnt mit v
\item \texttt{[a\$=v]}: endet mit v
\item \texttt{[a*=v]}: v ist mindestens einmal enthalten
\end{itemize}


\subsection*{Pseudoelement}
\label{sec:orga136a16}
Pseudoelemente erlauben es, bestimmte Teile eines Elements zu formatieren.
\begin{itemize}
\item \texttt{::first-line}
\item \texttt{::first-letter}
\item \texttt{::before} (erstellt neues Element)
\item \texttt{::after} (erstellt neues Element)
\item \texttt{::selection}
\end{itemize}


\subsection*{Pseudoklassen}
\label{sec:orge8eb865}
Pseudklassen werden verwendet, um auf Basis von verschiedenen Zuständen oder Eigenschaften Elemente zu selektieren.
\begin{itemize}
\item dynamische Klassen: \texttt{:hover}, \texttt{:focus}, \texttt{:visited}, \ldots{}
\item strukturelle Klassen: \texttt{:root}, \texttt{:first-child}, \texttt{:nth-child()}, \texttt{:empty}, \ldots{}
\item andere: \texttt{:lang()}, \texttt{:not()}, \ldots{}
\end{itemize}


Bei den Pseudoklassen die mit \texttt{nth-} beginnen, starte der Index bei 1. Die Pseudoklasse \texttt{:not} darf keine Pseudoelemente und keine weiteres \texttt{:not} enthalten.


\subsection*{Kombinatoren}
\label{sec:orgbefb30e}
\begin{itemize}
\item \texttt{e > s}: Kindselektor
\item \texttt{e s}: Nachfarenselektor
\item \texttt{e + s}: Angrenzende Geschwister (Nachbar)
\item \texttt{e \textasciitilde{} s}: Allgemeine Geschwister
\end{itemize}


\subsection*{Spezifität}
\label{sec:org6836d57}
Mit CSS können verschiedene gegensätzliche Anweisungen verwendet werden. Hier entscheidet die Spezifizität. Quellen nach Priorität:
\begin{enumerate}
\item Browser (mit Default Werten)
\item Benutzer (Vom Nutzer des Browser)
\item Autor (Stylesheets, welche mit der Webseite mitgeliefert werden.
\end{enumerate}


Um die Spezifität wird aus dem gesamten Selektor berechnet:
\begin{enumerate}
\item Drei Zähler (A, B, C) mit Startwert 0
\item A++ für jeden Selektor von IDs (\#\ldots{})
\item B++ für jeden Selektor von Klassen (. \ldots{}), sowie Pseudoklassen (: \ldots{}) und Attributen ([\ldots{}])
\item C++ für jeden Selektor von Element-Typen sowie Pseudoelementen (:: \ldots{})
\item Spzifität = \(A \cdot 100 + B \cdot 10 + C\)
\end{enumerate}

Der Universalselektor \texttt{*} wird ignoriert.

Das Keyword \texttt{!important} kann ein Style als wichtig markieren. Sollte nie verwendet werden, wenn das CSS unter eigener Kontrolle ist.
\section*{DOM}
\label{sec:org1a28819}
\textbf{Document Object Model (DOM)} repräsentiert HTML-Dokument als Busstruktur. Attribute Nodes sind zugreifbar mit \texttt{elementNode.getAttributeNode()} gelten aber nicht als Teil des DOM Trees.

\subsection*{DOM suchen}
\label{sec:org2ee09f2}
\begin{itemize}
\item \texttt{document.getElementById()}
\item \texttt{document.getElemtsByName()}
\item \texttt{<searchRoot>.getElementsByClassName()}
\item \texttt{<searchRoot>.getElementsByTagName()}
\item \texttt{<searchRoot>.querySelector()}
\item \texttt{<searchRoot>.querySelectorAll()}
\item \texttt{<searchRoot>.closets()}
\item \texttt{<searchRoot>.matches()}
\end{itemize}

die \texttt{getElementsBy...} Funktionen geben eine \texttt{HTMLCollection} zurück (kein Array). Beim Anpassen des DOMs wird die Collection angepasst (Live-Queries, gefährlich). Es sollte daher die modernen Such-Funktionen verwendet werden. Diese erzeugen keine Live-Queries. Auch die neuen Funktionen geben \textbf{kein} Array zurück (umwandlung mittels \texttt{Array.from()} oder \texttt{[...nodeList]})

\subsection*{DOM Navigation}
\label{sec:orgb8a2b81}
Node Interface hat Methoden zur Navigation in DOM (read-only!):
\begin{itemize}
\item \texttt{<node>.parentElement}
\item \texttt{<node>.childNodes} (auch Text-Nods, Kommentare)
\item \texttt{<node>.children} (nur HTMLElemente)
\item \texttt{<node>.firstChild} (auch text-Nodes, Kommentare)
\item \texttt{<node>.firstElementChild} (HTMLElemente)
\item \texttt{<node>.nextSibling} (auch Text, Kommentare)
\item \texttt{<node>.nextElementSibling} (Element)
\end{itemize}

\subsection*{DOM Manipulation}
\label{sec:org952103d}
Neues Element erstellen:
\begin{itemize}
\item \texttt{document.createElement()}
\item \texttt{document.createTextNode()}
\item \texttt{document.createDocumentFragment}
\end{itemize}

Empfohlen über \texttt{container.insertAdjacentHTML()}. Um CSS-Classen zu manipulieren sollten \texttt{<element>.classList} genutzt werden und nicht mehr \texttt{className}. Die Property Style sollte nicht genutzt werden. Besser ist das setzten einer CSS-Klasse.

Bezüglich Performance sollte \textbf{nicht} innerHTML in einer Schleife verwendet werden (Einmalig OK).

\subsection*{Attribute}
\label{sec:org2f4de56}
\begin{itemize}
\item \texttt{setAttribute()}
\item \texttt{removeAttribute()}
\end{itemize}

Wenn boolesche Attribute im HTML gesetzt werden sind sie true (auch \texttt{checked ="false"} ist true). Wenn das Attribute nicht vorhanden ist, ist es false.

\subsection*{DOM Events}
\label{sec:org80bb851}
Um Events auf einem Element zu registrieren geht man wie folgt vor:
\begin{verbatim}
const element = document.querySelector('#myID');
element.addEventListner('click', () => alert('1'));
\end{verbatim}
Möglich auch über \texttt{element.on...} oder im HTML inline. Mittels \texttt{addEventListener} sind mehrere Registrierungen möglich. Die \texttt{on...} Variante überschreibt die vorherige Zuweisung. Die Inline-Version ist geeignet für Prototypen / Prüfung / Generierten Code).

Eine Event durchläuft 3. Phasen: 
\begin{enumerate}
\item \textbf{Capture-Phase}: vom Root zum Leaf (jedes Element kann reagieren)
\item \textbf{Target-Phase}: Event wird auf dem \emph{Ziel} ausgelöst
\item \textbf{Bubble Phase}: Das Event durchläuft den DOM von Leaf zum Root (nicht jedes Event)
\end{enumerate}

Bei den meisten Events werden Zusatzinformationen mit gegeben. Diese werden der Event-Callback-Funktion als Parmeter mitgegeben. Das Event-Object hat folgende wichtigen Properties / Methoden: 
\begin{itemize}
\item \texttt{target}: Element auf dem der Event ausgelöst wurde (z.B: l
\item \texttt{preventDefault()}: verhindert Default-Aktionen.
\item \texttt{currentTarget}
\item \texttt{stopPropagation()}: Ermöglicht das deaktivieren von \emph{Bubbling} und \emph{Capturing}
\end{itemize}
