wed1_summary.org
** DOM lifecycle
DOM kennt drei unterschiedliche Zustände: 
- *loading*: Dokument wird geladen
- *interactive*: Dokument wurde geladen, gewisse Ressourcen fehlen noch (Bilder, Stylsheets, Frames)
-  *complete*: Das Dokument und alle Ressourcen sind geladen (wird durch das Event =load= representiert)

Script tags können mit =defer= oder =async= markiert werden. *defer* Script Files sollen erst name dem Parsen vom Dokument ausgeführt werden. Reihenfolge der Files wird gewährleistet. Bei *async* werden die Script-Files asynchron geladen, die Reihenfolge der Files wird nicht gewährleistet.

** Data-* Attribute
HTML Elemente habe fest definierte Attribute. Eigenen Attribute müssen mit dem Prefix =data= beginnen. Diese Attribute könne benutzt werden um Daten zwischen HTML und JS auszutauschen. Die Werte werden als /Dictionary/ im Property =dataset= abgelegt. Im HTML wird kebab-case verwendet. Im Dictionary wird es als camelCase verwendet (=data-factory-id => dataSet.factoryId=)

* Clean Code
Clean Code meint sauberen, gut wartbaren und gut lesbaren Code. Clean Code sollte immer das Ziel sein. Um dieses Ziel zu erreichen sollten Linter zum Einsatz kommen, welche Style-Regeln aufzwingen sollen. 
Wichtige Punkte für Clean Code:
- Names: Descripitive Names, Use Standard Nomeclature Where Possible
- Functions: Too Many Arguments, Output Arguments, Flag Arguments => Split, any dead code
- Comments: Obsolet Comment, Commented-Out Code
- General: Use Explanatory Varaibles, Follow Standard Conventions, Replace Magic Number with Named Constats 

** Clean DOM - MVC
*Model-View-Controller (MVC)* ist eine GUI Architektur. Das *Model* speichert den Status der App (User Data, UI State) und die Busniness Logic. Das Model hat keine Referenzen auf den DOM. Die *View* ist für die Darstellung zuständig. Der *Controller* verarbeitet User Input und wechselt die View (Routing).

** async JS
Async JS ist JavaScript, dass in Callbacks ausgeführt wird. ([[https://youtu.be/cCOL7MC4Pl0?t=411][Jake Archibald: In The Loop - JSConf.Asia - YouTube]]). Event Handler, Timer Callbacks (setTimout), Network Callbacks (fetch) und async Functions, Promise, await sind async. Es sollten keine DOM Updates im Main-Thread gemacht werden (blocking)


* HTTP
URL: Anchor / Frament identifyer wird nicht an den Server geschickt. Für das URL encoding sollten =encdeURI= und =encodeURIComponent=


** Promise
Wichtige Zustände:
- *pending*: Async-Operation aktiv
- *fullfilled*: Async-Operation erfolgreich beendet, Wert verfügbar
- *rejected*: Async-Operation erfolgreich beendet, Fehler-Detail verfügbar

Funktionen mit Promises =.then()=, =.cancel()=, =await=, =try-catch=.

** Fetch
#+begin_src js
fetch(url)
    .then(response => {
        console.log(response);
        return response.text();
    })
    .then(text => console.log(text));
#+end_src

#+begin_src js
const response = fetch(url);
console.log(response);
const responseText = response.text();
console.log(responseText);
#+end_src

=.catch()= kann am Schluss angehängt werden und es fängt alle vorherigen Erros auf. Alternative kann mit =try-catch= gearbeitet werden.

Um eine POST Request zu erstellen, müssen die Optionen als Objekt an =fetch= übergeben werden.
#+begin_src js
const fetchOptions = {
    "method": "POST",
    "header": {
        "accept": "application/json",
        "content-type": "application/json"
    },
    "body": JSON.stringify(song)
}
const response = await fetch(url, fetchOptions);
#+end_src

* Node
** Webserver
Um mit Node einen Webserver zu programmieren muss das Modul =http= importiert werden.

#+begin_src js
import http from 'http';

const PORT = 8080;

function requestHandler(req, res) {
    res.write('<h1>Hello ');
    res.end('World</h1>');
}

const server = http.createServer();
server.on('request', requestHandler);

server.listen(PORT,
        () => console.log('Node listening on Port ', PORT));
#+end_src

#+begin_src js
const parsedURL = new URL(req.url, `http://${req.headers.host}`);
#+end_src

*Do not implement your own file server!* Benutzt ein Package, z.B. node-static.


** SOP / CORS
*Same Origin Policy (SOP)*: Nur Seiten dürfen sich verbinden, die auch von diesem Server geservt wurde. *Cross Origin Resource Sharing (CORS)* wenn ein Server auch von anderen Origins kontaktiert wird, muss der Server im Header der Response das Feld =Access-Control-Allow-Origin= auf die Origin des Browser bzw. auf =*= setzten.


* REST
*Representational State Transfer (REST)*
Levels of REST: Level 0 - The Swamp of POX, Level 1 - Resources, Level 2 - HTTP Verbs, Level 3 - Hypermedia Controls

* End
\end{multicols}
