WED1/wed1_summary.tex

\subsection*{DOM lifecycle}
\label{sec:orgd6bcef9}
DOM kennt drei unterschiedliche Zustände: 
\begin{itemize}
\item \textbf{loading}: Dokument wird geladen
\item \textbf{interactive}: Dokument wurde geladen, gewisse Ressourcen fehlen noch (Bilder, Stylsheets, Frames)
\item \textbf{complete}: Das Dokument und alle Ressourcen sind geladen (wird durch das Event \texttt{load} representiert)
\end{itemize}

Script tags können mit \texttt{defer} oder \texttt{async} markiert werden. \textbf{defer} Script Files sollen erst name dem Parsen vom Dokument ausgeführt werden. Reihenfolge der Files wird gewährleistet. Bei \textbf{async} werden die Script-Files asynchron geladen, die Reihenfolge der Files wird nicht gewährleistet.

\subsection*{Data-* Attribute}
\label{sec:orgb2ab0a2}
HTML Elemente habe fest definierte Attribute. Eigenen Attribute müssen mit dem Prefix \texttt{data} beginnen. Diese Attribute könne benutzt werden um Daten zwischen HTML und JS auszutauschen. Die Werte werden als \emph{Dictionary} im Property \texttt{dataset} abgelegt. Im HTML wird kebab-case verwendet. Im Dictionary wird es als camelCase verwendet (\texttt{data-factory-id => dataSet.factoryId})

\section*{Clean Code}
\label{sec:org6d5d41f}
Clean Code meint sauberen, gut wartbaren und gut lesbaren Code. Clean Code sollte immer das Ziel sein. Um dieses Ziel zu erreichen sollten Linter zum Einsatz kommen, welche Style-Regeln aufzwingen sollen. 
Wichtige Punkte für Clean Code:
\begin{itemize}
\item Names: Descripitive Names, Use Standard Nomeclature Where Possible
\item Functions: Too Many Arguments, Output Arguments, Flag Arguments => Split, any dead code
\item Comments: Obsolet Comment, Commented-Out Code
\item General: Use Explanatory Varaibles, Follow Standard Conventions, Replace Magic Number with Named Constats
\end{itemize}

\subsection*{Clean DOM - MVC}
\label{sec:org53a2fae}
\textbf{Model-View-Controller (MVC)} ist eine GUI Architektur. Das \textbf{Model} speichert den Status der App (User Data, UI State) und die Busniness Logic. Das Model hat keine Referenzen auf den DOM. Die \textbf{View} ist für die Darstellung zuständig. Der \textbf{Controller} verarbeitet User Input und wechselt die View (Routing).

\subsection*{async JS}
\label{sec:orgd37fbee}
Async JS ist JavaScript, dass in Callbacks ausgeführt wird. (\href{https://youtu.be/cCOL7MC4Pl0?t=411}{Jake Archibald: In The Loop - JSConf.Asia - YouTube}). Event Handler, Timer Callbacks (setTimout), Network Callbacks (fetch) und async Functions, Promise, await sind async. Es sollten keine DOM Updates im Main-Thread gemacht werden (blocking)


\section*{HTTP}
\label{sec:org8dd472d}
URL: Anchor / Frament identifyer wird nicht an den Server geschickt. Für das URL encoding sollten \texttt{encdeURI} und \texttt{encodeURIComponent}


\subsection*{Promise}
\label{sec:orgd593752}
Wichtige Zustände:
\begin{itemize}
\item \textbf{pending}: Async-Operation aktiv
\item \textbf{fullfilled}: Async-Operation erfolgreich beendet, Wert verfügbar
\item \textbf{rejected}: Async-Operation erfolgreich beendet, Fehler-Detail verfügbar
\end{itemize}

Funktionen mit Promises \texttt{.then()}, \texttt{.cancel()}, \texttt{await}, \texttt{try-catch}.

\subsection*{Fetch}
\label{sec:orge04d172}
\begin{verbatim}
fetch(url)
    .then(response => {
	console.log(response);
	return response.text();
    })
    .then(text => console.log(text));
\end{verbatim}

\begin{verbatim}
const response = fetch(url);
console.log(response);
const responseText = response.text();
console.log(responseText);
\end{verbatim}

\texttt{.catch()} kann am Schluss angehängt werden und es fängt alle vorherigen Erros auf. Alternative kann mit \texttt{try-catch} gearbeitet werden.

Um eine POST Request zu erstellen, müssen die Optionen als Objekt an \texttt{fetch} übergeben werden.
\begin{verbatim}
const fetchOptions = {
    "method": "POST",
    "header": {
	"accept": "application/json",
	"content-type": "application/json"
    },
    "body": JSON.stringify(song)
}
const response = await fetch(url, fetchOptions);
\end{verbatim}

\section*{Node}
\label{sec:orgda3e902}
\subsection*{Webserver}
\label{sec:org02df8a2}
Um mit Node einen Webserver zu programmieren muss das Modul \texttt{http} importiert werden.

\begin{verbatim}
import http from 'http';

const PORT = 8080;

function requestHandler(req, res) {
    res.write('<h1>Hello ');
    res.end('World</h1>');
}

const server = http.createServer();
server.on('request', requestHandler);

server.listen(PORT,
	() => console.log('Node listening on Port ', PORT));
\end{verbatim}

\begin{verbatim}
const parsedURL = new URL(req.url, `http://${req.headers.host}`);
\end{verbatim}

\textbf{Do not implement your own file server!} Benutzt ein Package, z.B. node-static.


\subsection*{SOP / CORS}
\label{sec:org4a37bac}
\textbf{Same Origin Policy (SOP)}: Nur Seiten dürfen sich verbinden, die auch von diesem Server geservt wurde. \textbf{Cross Origin Resource Sharing (CORS)} wenn ein Server auch von anderen Origins kontaktiert wird, muss der Server im Header der Response das Feld \texttt{Access-Control-Allow-Origin} auf die Origin des Browser bzw. auf \texttt{*} setzten.


\section*{REST}
\label{sec:org75ea070}
\textbf{Representational State Transfer (REST)}
Levels of REST: Level 0 - The Swamp of POX, Level 1 - Resources, Level 2 - HTTP Verbs, Level 3 - Hypermedia Controls

\section*{End}
\label{sec:orgd00eec7}
\end{multicols}
\end{document}